/* вызов предиката minesweeper/2, который используется для создания игрового поля размером 5х5.
Первый параметр — это стартовая сетка, второй параметр должен содержать результат после завершения.
*/

minesweeper([
[_,_,_,_,_],
[_,_,2,2,_],
[_,_,2,*,_],
[_,_,2,2,_],
[_,_,_,_,_]], X).

minesweeper([
[_,_,_,*,*],
[_,*,1,1,1],
[_,*,1,_],
[_,*,1,_,_],
[_,_,_,_,_]], X).

minesweeper([
[_,*,2,_,1],
[2,*,_,_,*],
[*,_,*,*,_]
[2,*,3,2,_],
[_,_,*,_,_]], X).

minesweeper([
[_,*,3,_,1],
[2,*,*,*,_],
[_,_,2,2,_],
[1,*,3,_,_],
[_,*,*,_,_]], X).

minesweeper(
[[_,*,1,_,*],
[_,1,_,*,2],
[_,_*,2,1,_],
[2,*,2,_,_],
[*,2,_,*,_]], X).

minesweeper([
[_,*,_,_,*],
[2,*,2,2,*],
[_,*,3,_,_],
[_,*,2,1,*],
[_,_,_,1,_], X).

minesweeper([
[_,_,2,*,3],
[_,_,2,*,*],
[_,_,1,2,2],
[1,*,_,_,_],
[_,_,_,_*,1]], X).